from math import sqrt

a, b, c = map(float, input().split(' '))  # Считываем три вещественных числа A, B, C
arr = []
if a != 0:
    d = b ** 2 - 4 * a * c  # Вычисляем дискриминант
    if d > 0:
        # Вычисляем корни уравнения
        x1 = (-b + sqrt(d)) / (2 * a)
        x2 = (-b - sqrt(d)) / (2 * a)
        # Добавляем корни уравнения в массив
        arr.append(x1)
        arr.append(x2)
        print("Уравнение", "\n", "%.5f" % a, "* x ** 2 +", "%.5f" % b, "* x +", "%.5f" % c, '=', 0)
        print("Количество корней: ", len(arr))
        print("%.5f" % x1, "\n" "%.5f" % x2)
    elif d == 0:  # Проверяем случай, когда дискриминант = 0
        x3 = -b / (2 * a)
        x4 = -b / (2 * a)
        # Добавляем корни уравнения в массив
        arr.append(x3)
        arr.append(x4)
        print("Уравнение", "\n", "%.5f" % a, "* x ** 2 +", "%.5f" % b, "* x +", "%.5f" % c, '=', 0)
        print("Количество корней: ", len(arr))
        print("%.5f" % x3)
        print("%.5f" % x4)
    else:
        print("Уравнение", "\n", "%.5f" % a, "* x ** 2 +", "%.5f" % b, "* x +", "%.5f" % c, '=', 0)
        print("Количество корней: ", len(arr))
